#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ФамилияПриИзменении(Элемент)
	УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ИмяПриИзменении(Элемент)
	УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ОтчествоПриИзменении(Элемент)
	УстановитьНаименование();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура УстановитьНаименование()
	Объект.Наименование = Объект.Фамилия + " " + Объект.Имя + " " + Объект.Отчество;
КонецПроцедуры
#КонецОбласти





