#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары
	
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	УстановитьСуммуТекущейСтрокиТЧТовары();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	УстановитьСуммуТекущейСтрокиТЧТовары();
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	УстановитьСуммуТекущейСтрокиТЧУслуги();
КонецПроцедуры

&НаКлиенте
Процедура УслугиКоличествоПриИзменении1(Элемент)
	УстановитьСуммуТекущейСтрокиТЧУслуги();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура УстановитьСуммуТекущейСтрокиТЧТовары()
	ТекДанные = Элементы.Товары.ТекущиеДанные;
	ТекДанные.Сумма = ТекДанные.Цена * ТекДанные.Количество;		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСуммуТекущейСтрокиТЧУслуги()
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	ТекДанные.Сумма = ТекДанные.Цена * ТекДанные.Количество;		
КонецПроцедуры
#КонецОбласти
